In [50]:
import pandas as pd

In [51]:
#dict of items
items = {'Laurent': pd.Series(data=[245,25,55], index = ['bike','pants','watch']),
         'Emily': pd.Series(data=[40,110,500,45], index = ['book','glasses','bike','pants'])
        }

In [52]:
shopping_carts = pd.DataFrame(items)

In [53]:
shopping_carts

         Laurent  Emily
bike       245.0  500.0
book         NaN   40.0
glasses      NaN  110.0
pants       25.0   45.0
watch       55.0    NaN

In [54]:
# We print some information about shopping_carts
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The data in shopping_carts is:
 [[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Laurent', 'Emily'], dtype='object')

In [55]:
laurent_shopping_carts = pd.DataFrame(items,columns=['Laurent'])
laurent_shopping_carts

       Laurent
bike       245
pants       25
watch       55

In [56]:
emily_shopping_carts = pd.DataFrame(items,columns=['Emily'])
emily_shopping_carts

         Emily
book        40
glasses    110
bike       500
pants       45

In [57]:
# We Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Emily'])

# We display alice_sel_shopping_cart
alice_sel_shopping_cart

         Emily
glasses    110
bike       500

In [58]:
# We create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# We create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])

# We display the DataFrame
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [59]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

# We display the DataFrame
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [60]:
# We print the store_items DataFrame
print(store_items)

# We access rows, columns and elements using labels
print()
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print()
print('What items are in Store 1:\n', store_items.loc[['store 1']])
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0


How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

What items are in Store 1:
          bikes  pants  watches  glasses
store 1     20     30       35      NaN

How many bikes are in Store 2: 15

In [61]:
store_items['shirts'] = [10,30]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      10
store 2     15      5       10     50.0      30

In [62]:
store_items['suits'] = store_items['pants'] + store_items['shirts']

In [63]:
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      10     40
store 2     15      5       10     50.0      30     35

In [64]:
# We create a dictionary from a list of Python dictionaries that will number of items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We display the items at the new store
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [65]:
# We append store 3 to our store_items DataFrame
store_items = store_items.append(new_store)

# We display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    10.0   40.0       35
store 2     15     50.0      5    30.0   35.0       10
store 3     20      4.0     30     NaN    NaN       35

In [66]:
# We add a new column using data from particular rows in the watches column
store_items['new watches'] = store_items['watches'][1:]

# We display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    10.0   40.0       35          NaN
store 2     15     50.0      5    30.0   35.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [67]:
# We insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    10.0      8   40.0       35          NaN
store 2     15     50.0      5    30.0      5   35.0       10         10.0
store 3     20      4.0     30     NaN      0    NaN       35         35.0

In [68]:
#The .pop() method only allows us to delete columns, while 
#the .drop() method can be used to delete both rows and columns by use of the axis keyword. 
#Let's see some examples

In [69]:
# We remove the new watches column
store_items.pop('new watches')

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    10.0      8   40.0       35
store 2     15     50.0      5    30.0      5   35.0       10
store 3     20      4.0     30     NaN      0    NaN       35

In [70]:
# We remove the watches and shoes columns
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    10.0   40.0
store 2     15     50.0      5    30.0   35.0
store 3     20      4.0     30     NaN    NaN

In [71]:
# We remove the store 2 and store 1 rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

In [72]:
# We change the column label bikes to hats (rename method + attribut columns)
store_items = store_items.rename(columns = {'bikes': 'hats','suits':'costumes'})

# we display the modified DataFrame
store_items

         hats  glasses  pants  shirts  costumes
store 3    20      4.0     30     NaN       NaN

In [73]:
# We change the row label from store 3 to last store (rename method + attribut index)
store_items = store_items.rename(index = {'store 3': 'last store'})

# we display the modified DataFrame
store_items

            hats  glasses  pants  shirts  costumes
last store    20      4.0     30     NaN       NaN

In [74]:
# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

       hats  glasses  shirts  costumes
pants
30       20      4.0     NaN       NaN